<?php
/**
 * api.game 游戏项目语言包
 */
return [
    -3 => '中国IP禁止登陆|400',
    -2 => '操作失败|400',
    -1 => '程序调试',
    0 => '操作成功|200',
    1 => '登录成功|200',
    2 => '退出成功|200',
    3 =>'参数不能为空',
    4 =>'账号或密码错误',
    5 =>'账号已被停用',
    6 =>'IP已被限制登录',
    7 =>'参数不能为空',
    8=>'已有相同数据',
    9=>'用户不存在',
    10=>'id不能为空',
    12=>'请先删除支付通道',
    13=>'请叫技术先对该渠道配置模板',
    14=>'已存在该支付类型通道',
    15  => '你的操作过于频繁，请稍候再试',
    20=>'该厅主该渠道回调IP白名单已存在',
    25=>'开始时间不能大于结束时间！',

    30 => '上传失败',
    31 => '缺少参数或参数错误|400',
    32 => '不存在数据！|400',

    100 =>'客户不存在!',
    101 =>'获取数据失败！',
    120 =>'第三方未有提供汇总查询！',

    121 => '图形验证码错误，请重新输入！|400',

    886 => '%s|400',

];